Revit 2027 API
BendingDetailCustomFieldMultipleValuesIndicatorOptions Enumeration
 Describes how the parameters with multiple values will be represented.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum BendingDetailCustomFieldMultipleValuesIndicatorOptions
Public Enumeration BendingDetailCustomFieldMultipleValuesIndicatorOptions
public enum class BendingDetailCustomFieldMultipleValuesIndicatorOptions
type BendingDetailCustomFieldMultipleValuesIndicatorOptions
Members
Member name | Value | Description
MinimumMaximum | 1 |  The values will be obtained from all included bars in the rebar set and it will be shown in a form like minimumValue...maximumValue.
Varying | 0 |  The values will be obtained from all included bars in the rebar set and it will be shown the multiple varies indicator if they are different.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace